In [1]:
import pandas as pd
import numpy as np

## Processing missing data

### Selecting missing data

In [2]:
string_data = pd.Series(['asdf', 'zxcv', np.nan, 'qwer'])  # None을 써도 NA처리 된다.
print(string_data, '\n')
print(string_data.isnull())

0    asdf
1    zxcv
2     NaN
3    qwer
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

dropna : 누락된 데이터가 있는 axis를 drop  
fillna : 누락된 데이터를 대신할 값, 또는 method를 지정  
isnull : 위 처럼 NA임을 알려주는 bool배열을 반환  
notnull: isnull과 반대임  
inplace: 객체를 반환하면서 기존 객체값 변경도 진행

In [3]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
print(data.dropna(), '\n')  # drop된 axis를 매꾸진 않고 누락된 데이터가 없는 axis만 반환해줌
print(data[data.notnull()])  # 위와 동치인 구문

0    1.0
2    3.5
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data = pd.DataFrame([[1., 6.5, 3.], 
                     [1., NA, NA],
                     [NA, NA, NA], 
                     [NA, 6.5, 3]])
print(data,'\n')
print(data.dropna(),'\n') #NA가 있는 row를 제외하고 출력

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [5]:
data[4] = NA
print(data, '\n')
print(data.dropna(how='all'), '\n')  # 전체가 NA인 row를 제외하고 출력
print(data.dropna(axis=1, how='all'))  # 축 변경

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [6]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
print(df, '\n')
print(df.dropna(), '\n')
print(df.dropna(thresh=2), '\n')  # NA가 2개이상이면 캇

          0         1         2
0 -0.579611       NaN       NaN
1  1.021125       NaN       NaN
2  1.149047       NaN  0.576075
3  0.431553       NaN -1.044888
4 -0.514166  0.062244  1.126931
5 -1.781519  1.081213  0.700359
6  0.027511 -2.066546 -1.322200

          0         1         2
4 -0.514166  0.062244  1.126931
5 -1.781519  1.081213  0.700359
6  0.027511 -2.066546 -1.322200

          0         1         2
2  1.149047       NaN  0.576075
3  0.431553       NaN -1.044888
4 -0.514166  0.062244  1.126931
5 -1.781519  1.081213  0.700359
6  0.027511 -2.066546 -1.322200

### Filling missing data

In [7]:
# fillna로 NA를 싹다 통일되게 매꿀 수 있다.

df.fillna(0)

          0         1         2
0 -0.579611  0.000000  0.000000
1  1.021125  0.000000  0.000000
2  1.149047  0.000000  0.576075
3  0.431553  0.000000 -1.044888
4 -0.514166  0.062244  1.126931
5 -1.781519  1.081213  0.700359
6  0.027511 -2.066546 -1.322200

In [8]:
# Dict를 넘기면 각 col마다 다른 값으로 매꿀 수 있다.

df.fillna({1: "여긴 col1", 2: "여긴 col2"})

          0         1         2
0 -0.579611   여긴 col1   여긴 col2
1  1.021125   여긴 col1   여긴 col2
2  1.149047   여긴 col1  0.576075
3  0.431553   여긴 col1 -1.044888
4 -0.514166  0.062244  1.126931
5 -1.781519  1.081213  0.700359
6  0.027511 -2.066546   -1.3222

In [9]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.462825  1.847018 -1.069865
1 -0.712172  1.781825  1.721272
2  1.537207       NaN  0.622399
3 -1.099757       NaN  0.478133
4  0.639557       NaN       NaN
5  0.444459       NaN       NaN

In [10]:
# ffill을 쓰면 이전값을 가져오고
# limit을 걸어서 현재 axis에서 최대 몇개를 채울지 지정

df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.462825  1.847018 -1.069865
1 -0.712172  1.781825  1.721272
2  1.537207  1.781825  0.622399
3 -1.099757  1.781825  0.478133
4  0.639557       NaN  0.478133
5  0.444459       NaN  0.478133

In [11]:
#가장 평범하게 매꾸는 방식. 평균값으로 매꾸기

data = pd.Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Manipulating Data

### Erasing duplicated data

In [12]:
data = pd.DataFrame(
    {'k1': ['one', 'two']*3+['two'],
     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [13]:
# duplicated: 중복되는 row가 있는지 알려주는 bool 변수 반환
# drop_duplicates: 중복되는 값이 있는 axis drop

print(data.duplicated(), '\n')
print(data.drop_duplicates())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [14]:
data['v1'] = range(7)
print(data.drop_duplicates(['k1']), '\n')  # 모든 col이 아닌 특정 col을 기준으로 할 경우

# keep='last'로 할경우 중복된 값 중에서 마지막 값을 살린다
print(data.drop_duplicates(['k1', 'k2'], keep='last'))

    k1  k2  v1
0  one   1   0
1  two   1   1

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Manipulating with func & mapping

In [15]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [16]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [17]:
# str.lower()을 이용하여 모든 문자를 소문자로 변경

lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [18]:
# map 메서드를 이용하여 dict, function을 받아서 mapping 진행 가능

data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [19]:
# 함수를 넘겨서 같은 작업 수행 가능
# data['food']값들을 labda함수에 넘겨준다.

data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Changing Value

In [20]:
data = pd.Series([1., -999., 2., -999, -1000, 3])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [21]:
# .replace()를 이용하여 특정 값을 치환가능
# list또는 dict를 이용

print(data.replace([-999, -1000], ['first', 'second']), '\n')
print(data.replace({-999: 'first', -1000: 'second'}))

0       1.0
1     first
2       2.0
3     first
4    second
5       3.0
dtype: object

0       1.0
1     first
2       2.0
3     first
4    second
5       3.0
dtype: object

### changing axis index name

In [22]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [23]:
transform = lambda x:x[:4].upper()

# inex를 입력으로 받아서 transform에 넘겨준다
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [24]:
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [25]:
# reanme으로 인덱스와 col이름을 변경가능. 이후 객체 반환
# str.title: 첫글자를 대문자로

data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [26]:
# dict를 넣어주면 특정 값을 변경하는 것이 가능하다.

data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### 개별화와 양자화 (해석귀찮다)

In [27]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [28]:
# .cut(data, 경계값)
# Categorical 객체가 반환됨. 그룹 이름이 담긴 배열이며 그룹명은 아래 뜸

cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [29]:
# 그룹명을 지정하는 것도 가능

group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [30]:
# 경곗값이 아닌 그룹의 개수를 넘기면 알아서균등한 길이의 그룹 계산후 반환
# 길이가 균등한거지 개수가 균등하게 아님

data = np.random.rand(20)
cats=pd.cut(data,4,precision=2)

print(cats,'\n')
print(pd.value_counts(cats))

[(0.72, 0.94], (0.27, 0.49], (0.27, 0.49], (0.052, 0.27], (0.49, 0.72], ..., (0.052, 0.27], (0.72, 0.94], (0.72, 0.94], (0.27, 0.49], (0.27, 0.49]]
Length: 20
Categories (4, interval[float64, right]): [(0.052, 0.27] < (0.27, 0.49] < (0.49, 0.72] < (0.72, 0.94]]

(0.27, 0.49]     7
(0.72, 0.94]     7
(0.052, 0.27]    4
(0.49, 0.72]     2
dtype: int64

In [31]:
# qcut을 이용하면 표본의 변위를 기반으로 개수가 동일하게 데이터를 나눈다.
# 덕분에 cut과 달리 데이터의 분산값에 따라 데이터가 다르게 나눠지는 경우를 막을 수 있다.

data =np.random.randn(1000)

cats = pd.qcut(data,4)

print(cats,'\n')
pd.value_counts(cats)

[(-0.692, 0.0245], (-0.692, 0.0245], (-0.692, 0.0245], (-0.692, 0.0245], (-3.887, -0.692], ..., (-0.692, 0.0245], (0.0245, 0.694], (0.694, 2.854], (-3.887, -0.692], (-0.692, 0.0245]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.887, -0.692] < (-0.692, 0.0245] < (0.0245, 0.694] < (0.694, 2.854]]

(-3.887, -0.692]    250
(-0.692, 0.0245]    250
(0.0245, 0.694]     250
(0.694, 2.854]      250
dtype: int64

In [32]:
#밑에 있는거는 변위치임. 0~10% 10%~50% 이런식으로 잘라줌

pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(-1.268, 0.0245], (-1.268, 0.0245], (-1.268, 0.0245], (-1.268, 0.0245], (-3.887, -1.268], ..., (-1.268, 0.0245], (0.0245, 1.195], (0.0245, 1.195], (-3.887, -1.268], (-1.268, 0.0245]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.887, -1.268] < (-1.268, 0.0245] < (0.0245, 1.195] < (1.195, 2.854]]

### Excluding outlier value

In [33]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.112578     0.014158     0.008160     0.012671
std       1.028984     0.980492     1.021799     0.976044
min      -3.710801    -3.632106    -2.960957    -2.826231
25%      -0.776422    -0.669231    -0.649944    -0.659797
50%      -0.127267     0.026726     0.018576     0.011655
75%       0.577981     0.690032     0.685272     0.673417
max       3.186907     3.147209     3.101516     3.126388

In [34]:
# 절댓값이 3을 초과하는 모든 row 출력 (.any메소드 이용)
data[(np.abs(data)>3).any(1)]

            0         1         2         3
113  1.067385 -3.632106  1.137121  0.311804
300  3.186907 -2.351919  1.453464  0.565026
309 -3.017206  0.643707  0.521075  0.851848
405 -3.681828  0.005634 -1.120842 -1.030334
576  0.323621  3.147209  1.373280  1.174977
714  0.341669 -3.154033  2.517053  1.215581
738 -2.729581 -1.627071  3.101516 -0.317346
782 -3.710801 -1.947050  0.503772 -1.095004
840 -0.649111 -0.439845  1.024334  3.126388

In [35]:
# 이렇게 값을 선택해서 부호*3값으로 지정하면 3 or -3으로 설정 가능

data[np.abs(data) > 3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.111355     0.014797     0.008059     0.012545
std       1.023956     0.977392     1.021497     0.975648
min      -3.000000    -3.000000    -2.960957    -2.826231
25%      -0.776422    -0.669231    -0.649944    -0.659797
50%      -0.127267     0.026726     0.018576     0.011655
75%       0.577981     0.690032     0.685272     0.673417
max       3.000000     3.000000     3.000000     3.000000

In [36]:
# np.sign(data)는 data값의 부호가 담긴 배열을 반환

np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2  1.0  1.0 -1.0  1.0
3 -1.0  1.0 -1.0  1.0
4 -1.0 -1.0 -1.0  1.0

### 치환과 임의 샘플링

In [37]:
# numpy.random.permutation을 이용하면 row를 임의 순서로 재배치 가능

df = pd.DataFrame(np.arange(5*4).reshape((5, 4)))
print(df)
sampler = np.random.permutation(5)
sampler  # row순서가 바뀜을 알 수 있다.

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

array([0, 2, 3, 1, 4])

In [38]:
# permutation이 적용된 sampler를 df에 적용

df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

In [39]:
# 섞는게 아닌 임의 선택이 목적이라면 sample 메소드를 이용
# replace = True로 해주면 중복을 허용한다.

df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

### 표시자와 더미 변수

In [40]:
# https://zephyrus1111.tistory.com/91 설명은 여기가 더 나은듯
# 넘겨받은 데이터를 기준으로 col을 만들고 정수,실수 자료형이면 그냥 표시하고
# string 자료형은 해당 col에 대한 값을 row가 가지면 1, 아니면 0

df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1':range(6)})
print(df,'\n')
print(pd.get_dummies(df))
pd.get_dummies(df['key'])

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [41]:
# prefix=' txt '를 쓰면 col이름에 접두어로 들어간다.

dummies = pd.get_dummies(df['key'], prefix='접두어')
print(dummies)
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   접두어_a  접두어_b  접두어_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

   data1  접두어_a  접두어_b  접두어_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [42]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies.head(10)

C:\Users\Hesh\anaconda3\lib\site-packages\pandas\util\_decorators.py:311: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return func(*args, **kwargs)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [43]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))  # extend를 쓰면 list내부 값들의 원소들을 추가해준다.
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [44]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [45]:
# 뭉쳐있는 장르들을 split하는 방법
# get_indexer가 split된 장르들의 index들을 맵핑해준뒤 반환한다.

gen = movies.genres[0]
print(gen)
dummies.columns.get_indexer(gen.split('|'))

Animation|Children's|Comedy

array([0, 1, 2], dtype=int64)

In [46]:
# 되게 유용한 방식인 것 같다.

for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [47]:
# cut과 같은 이산함수를 조합하면 유용하다

np.random.seed(12345)


values = np.random.rand(10)
print(values,'\n')

bins = [0,0.2,0.4,0.6,0.8,1]
cut_result = pd.cut(values,bins)
print(cut_result,'\n')
pd.get_dummies(cut_result)

[0.92961609 0.31637555 0.18391881 0.20456028 0.56772503 0.5955447
 0.96451452 0.6531771  0.74890664 0.65356987]

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String data

### string object method

In [48]:
# 구분자로 구분된 문자열은 split()을 이용하여 분리

val = 'a,b, github'
val.split(',')

['a', 'b', ' github']

In [49]:
# 공백 문자를 지워주는 strip() 메서드와 같이 써주면 유용
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'github']

In [50]:
# + 연산으로 문자열을 합치는 것도 가능하다
first, second, third = pieces
first+"::"+second+'::'+third

'a::b::github'

In [51]:
# join 메서드는 들어온 리스트 튜플들 사이사이를 매꿔서 반환해준다.

'::'.join(pieces)

'a::b::github'

In [52]:
# index find 외에도 in 예약어로 부분 문자열 찾는 방식
# find는 못찾으면 -1을 반환하지만 index는 예외를 발생시킨다.

print('github' in val)
print(val.index('github'))
print(val.find('github'))

True
5
5

In [53]:
# count는 특정 문자열이 얼마나 발견되는지 반환

val.count(',')

2

In [54]:
# replace는 해당 문자열을 찾아내서 다른 문자로 변환해줌

val.replace(',', '바꾼 문자')

'a바꾼 문자b바꾼 문자 github'

### 정규 표현식

In [55]:
# re 모듈 함수를 이용하면 정규 표현식을 사용 가능

import re

text = "foo bar\t baz \tqux"

# re.split 메서드를 이용하면 정규 표현식을 먼저 컴파일 하고 split진행

re.split('\s+', text)  # \s+는 하나 이상의 공백을 의미

['foo', 'bar', 'baz', 'qux']

In [56]:
# re.compile은 정규 표현식을 컴파일하고 재사용할 수 있게 해줌
# 이러면 매번 컴파일할 필요가 없다. (cpu를 소중히하자)

regex = re.compile('\s+')
print(type(regex))  # 패턴이 들어간 것이 보인다
print(regex.split(text))
print(regex.findall(text))  # 정규 표현식에 매칭된 모든 패턴 목록 반환

<class 're.Pattern'>
['foo', 'bar', 'baz', 'qux']
[' ', '\t ', ' \t']

In [57]:
text = """Dave dave@google.com
steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE 는 대소문자 구분을 없애버림
regex = re.compile(pattern,flags=re.IGNORECASE)

In [58]:
print(regex.findall(text),'\n') # 패턴과 일치하는 모든 문자열
print(regex.search(text),'\n') # 패턴과 일치하는 첫 번째 문자열
print(regex.match(text),'\n') # 패턴이 문자열의 시작부터 끝까지 일치하는지 검사
print(regex.sub('바꿀 문자열',text)) #패턴과 일치하는 문자열을 다른 문자열로 교체

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

<re.Match object; span=(5, 20), match='dave@google.com'>

None

Dave 바꿀 문자열
steve 바꿀 문자열
Rob 바꿀 문자열
Ryan 바꿀 문자열

In [59]:
# 패턴을 괄호로 묶어주면 각 컴포넌트로 나눌 수 있다.

pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

regex = re.compile(pattern,flags=re.IGNORECASE)

In [60]:
# 괄호로 묶은 패턴들은 groups()메서드로 컴포넌트의 튜플을 얻을 수 있다.
m = regex.match('neogate10@gmail.com')

m.groups()

('neogate10', 'gmail', 'com')

In [61]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

### vectorized string function in pandas

In [70]:
# 문자열 정리중 누락값이 있으면 복잡함

import numpy as np

data = {'asdf': 'asdf@gmail.com', 'qwer': 'qwer@gmail.com',
        'zxcv': 'zxcv@naver.com', '난 없지롱': np.nan}

data = pd.Series(data)
print(data,'\n')
print(data.isnull())

asdf     asdf@gmail.com
qwer     qwer@gmail.com
zxcv     zxcv@naver.com
난 없지롱               NaN
dtype: object

asdf     False
qwer     False
zxcv     False
난 없지롱     True
dtype: bool

In [71]:
data.str.contains('gmail')

asdf      True
qwer      True
zxcv     False
난 없지롱      NaN
dtype: object

In [75]:
# 정규 표현식을 쓰면 일이 간단해진다.

print(pattern,'\n')

print(data.str.findall(pattern,flags=re.IGNORECASE),'\n') #정규 표현식으로 컴포넌트 분리
print(data.str.match(pattern,flags=re.IGNORECASE),'\n') # 해당 문자열이 패턴을 만족?

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

asdf     [(asdf, gmail, com)]
qwer     [(qwer, gmail, com)]
zxcv     [(zxcv, naver, com)]
난 없지롱                     NaN
dtype: object

asdf     True
qwer     True
zxcv     True
난 없지롱     NaN
dtype: object